[{
  "_id": {
    "$oid": "5bb7ae9bdf31c4ced79ad7dd"
  },
  "description": "<p>COMPOSER-PERFORMER&nbsp;Sabrina Schroeder (Canada) integrates tactile transducers, live processing, and self-built mechanics into performance that digs into heavy sound spaces that are as much about body-feel as they are about audible sound.<br /><br />Recent/current projects include residencies at <a href=\"https://civitella.org/fellows/\" target=\"_blank\">Civitella Ranieri</a> (Umbria, Italy) and the <a href=\"https://www.swr.de/swrclassic/experimentalstudio/swrclassic-experimentalstudio-100.html\" target=\"_blank\">Experimentalstudio des SWR</a> (Freiburg, Germany),&nbsp;with new commissions for <a href=\"https://www.iceorg.org/about-1\" target=\"_blank\">ICE Ensemble</a> (New York/Chicago), <a href=\"http://jackquartet.com/\" target=\"_blank\">JACK Quartet</a> (New York), <a href=\"http://www.architekpercussion.com/\" target=\"_blank\">Architek Percussion</a> (Toronto), <a href=\"http://www.nohaybanda.ca/description.html\" target=\"_blank\">No Hay Banda</a> (Montreal), and a collaborative project with theatre creator <a href=\"http://www.tarragontheatre.com/contributor/jenna-harris/\" target=\"_blank\">Jenna Harris</a> and <a href=\"https://www.thinedgenewmusiccollective.com/\" target=\"_blank\">Thin Edge Collective</a> (Toronto). &nbsp;<br /><br />Schroeder has been on the faculty of <a href=\"http://www.arts.rpi.edu/pl/iear-events\" target=\"_blank\">iEAR</a> (Integrated Electronic Arts) department at Rensselaer Polytechnic Institute (Troy, New York), the <a href=\"https://en.wikipedia.org/wiki/Royal_Northern_College_of_Music\" target=\"_blank\">Royal Northern College of Music</a> (Manchester UK), the <a href=\"https://www.banffcentre.ca/program-tags/summer-music-programs\" target=\"_blank\">Banff Summer Music Programs</a> (Banff, Canada).</p>\r\n<p>She is currently Assistant Professor of Composition at Simon Fraser University&rsquo;s interdisciplinary <a href=\"https://www.sfu.ca/sca.html\" target=\"_blank\">School for the Contemporary Arts</a> (Vancouver, Canada).<br /><br /></p>\r\n<p>Multi-length&nbsp;bios and press&nbsp;materials&nbsp;can be found <a href=\"http://www.sabrinaschroeder.com/materials\" target=\"_blank\">here</a>.</p>",
  "title": "Biography",
  "image": {
    "public_id": "fzxmug0vwndk7kbxrtiu",
    "version": 1539198631,
    "signature": "45ef2ec3b05b25ad27592fb70869d30c0530e5e8",
    "width": 4000,
    "height": 3000,
    "format": "jpg",
    "resource_type": "image",
    "url": "http://res.cloudinary.com/casperleerink/image/upload/v1539198631/fzxmug0vwndk7kbxrtiu.jpg",
    "secure_url": "https://res.cloudinary.com/casperleerink/image/upload/v1539198631/fzxmug0vwndk7kbxrtiu.jpg"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "5bc7983c2d73ad7877a34f00"
  },
  "description": "<p>Composer-performer&nbsp;Sabrina Schroeder (Canada) integrates tactile transducers, live processing, and self-built mechanics into performance that digs into heavy sound spaces that are as much about body-feel as they are about audible sound.<br /><br />Recent/current projects include residencies at Civitella Ranieri (Umbria, Italy) and the Experimentalstudio des SWR (Freiburg, Germany),&nbsp;with new commissions for ICE Ensemble (New York/Chicago), JACK Quartet (New York), Architek Percussion (Toronto), No Hay Banda (Montreal), and a collaborative project with theatre creator Jenna Harris and Thin Edge Collective (Toronto).&nbsp; <br /><br />Schroeder has been on the faculty of iEAR (Integrated Electronic Arts) department at Rensselaer Polytechnic Institute (Troy, New York), the Royal Northern College of Music (Manchester UK), the Banff Summer Music Programs (Banff, Canada), and is currently Assistant Professor of Composition at Simon Fraser University&rsquo;s interdisciplinary School for the Contemporary Arts (Vancouver, Canada).</p>",
  "title": "GENERAL BIO",
  "__v": 0
},{
  "_id": {
    "$oid": "5bc7986c2d73ad7877a34f01"
  },
  "description": "<p>Composer-performer Sabrina Schroeder builds live performance systems using tactile transducers and self-built mechanics to dig into heavy sound spaces that are as much about body-feel as they are about audible sound. She&rsquo;s been part of composer-performer collectives creating scored and improvised music, a back-up-band coordinator for teens in mental health housing, and has taught on the faculty of iEAR (Integrated Electronic Arts) department at RPI and the Royal Northern College of Music. She is currently Assistant Professor at Simon Fraser University&rsquo;s interdisciplinary School for the Contemporary Arts.</p>",
  "title": "PERFORMANCE BIO",
  "__v": 0
},{
  "_id": {
    "$oid": "5bc798a82d73ad7877a34f02"
  },
  "description": "<p class=\"p1\"><span class=\"s1\">Composer-performer Sabrina Schroeder (b. 1979, Canada) integrates tactile transducers, live processing, and self-built mechanics into performances that dig into heavy sound spaces that are as much about body-feel as they are about audible sound.</span>&nbsp;</p>\r\n<p class=\"p1\"><span class=\"s1\">Her work has been performed in 18 countries,&nbsp;including&nbsp;collaborations with Distractfold (UK), Rebekah Heller (USA), Ensemble Contemporain de Montr&eacute;al (Canada), S&eacute;verine Ballon (France), Ensemble Tzara (Switzerland), Hand Werk (Germany), Ensemble Argento, Ensemble Container (Switzerland), Vertixe Sonora (Spain), MusikFabrik (Germany), Dal Niente (USA), Ensemble Vortex (Switzerland), Stephane Ginsburg (Belgium), Michelle Lou and Scott Worthington (USA), and Quatuor Bozzini (Canada).<span class=\"Apple-converted-space\">&nbsp;</span></span></p>\r\n<p class=\"p1\"><span class=\"s1\">Current projects include new commissions for ICE Ensemble (New York/Chicago), the Americas Society (New York), JACK Quartet (New York), Architek Percussion (Toronto), No Hay Banda (Montreal), and a collaborative project with theatre creator Jenna Harris and Thin Edge Collective (Toronto).</span></p>\r\n<p class=\"p1\"><span class=\"s1\">Awarded residences include Civitella Ranieri (Umbria, Italy), Experimentalstudio des SWR (Freiburg, Germany), Banff Leighton Studios (Banff, Canada),&nbsp;</span>Villa Romana (Florence, Italy), and Cit&eacute; Internationale des Arts (Paris, France).</p>\r\n<p class=\"p1\"><span class=\"s1\">Schroeder has been on the faculty of iEAR (Integrated Electronic Arts) department at Rensselaer Polytechnic Institute (Troy, New York), the Royal Northern College of Music (Manchester, UK), and the Banff Summer Music Programs (Banff, Canada).<span class=\"Apple-converted-space\">&nbsp;</span></span></p>\r\n<p class=\"p1\"><span class=\"s1\">She is currently Assistant Professor of Composition at Simon Fraser University&rsquo;s interdisciplinary School for the Contemporary Arts (Vancouver, Canada).</span>&nbsp;</p>\r\n<p class=\"p1\">&nbsp;</p>\r\n<p class=\"p1\"><span class=\"s1\">PhD, Harvard University (2016)</span></p>\r\n<p class=\"p1\"><span class=\"s1\">MA, Wesleyan University (2006)</span></p>\r\n<p class=\"p1\"><span class=\"s1\">BMus, University of Victoria (2001)</span></p>\r\n<p class=\"p1\">&nbsp;</p>",
  "title": "LONG BIO (GRANTS)",
  "__v": 0
}]